1c/standalone/src/Documents/Кабиторий_ОказаниеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Кабиторий_ОказаниеУслуги</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.Кабиторий_СостоянияОказанияУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исход</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.Кабиторий_ИсходыОказанияУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/standalone/src/Enums/Кабиторий_СостоянияОказанияУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Кабиторий_СостоянияОказанияУслуги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаМодерации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акцептована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатСформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/standalone/src/Documents/Кабиторий_ОказаниеУслуги/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Выполняет защищённый переход состояния оказания услуги.
// Единственная точка смены реквизита Состояние (INV-09).
//
// Параметры:
//   ОказаниеУслугиСсылка - ДокументСсылка.Кабиторий_ОказаниеУслуги - агрегат
//   НовоеСостояние - EnumRef.Кабиторий_СостоянияОказанияУслуги - целевое состояние
//   Контекст - Структура - параметры перехода:
//     * Исход - EnumRef.Кабиторий_ИсходыОказанияУслуги - обязателен при переходе в «Закрыта»
//
// Возвращаемое значение:
//   ДокументСсылка.Кабиторий_ОказаниеУслуги - тот же агрегат после фиксации
//
Функция ВыполнитьПереход(ОказаниеУслугиСсылка, НовоеСостояние, Контекст = Неопределено) Экспорт

	Состояния = Перечисления.Кабиторий_СостоянияОказанияУслуги;

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.Кабиторий_ОказаниеУслуги");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ОказаниеУслугиСсылка);
		Блокировка.Заблокировать();

		Объект = ОказаниеУслугиСсылка.ПолучитьОбъект();

		Если НЕ ПереходДопустим(Объект.Состояние, НовоеСостояние) Тогда
			ВызватьИсключение СтрШаблон(
				"Недопустимый переход: %1 -> %2",
				Объект.Состояние, НовоеСостояние);
		КонецЕсли;

		Если НовоеСостояние = Состояния.Закрыта Тогда
			УстановитьИсходЗакрытия(Объект, Контекст);
		КонецЕсли;

		Объект.Состояние = НовоеСостояние;
		Объект.Записать();

		// TODO (следующие слайсы): движения регистров, доменное событие (§19),
		// доменная транзакция Акцепта при переходе в «Акцептована» (§6.3),
		// постановка/снятие блока (§6.2). Внешние эффекты - только через Outbox (INV-10).

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат ОказаниеУслугиСсылка;

КонецФункции

// Проверяет, разрешён ли переход между состояниями по таблице конечного автомата.
//
// Параметры:
//   ТекущееСостояние - EnumRef.Кабиторий_СостоянияОказанияУслуги
//   НовоеСостояние - EnumRef.Кабиторий_СостоянияОказанияУслуги
//
// Возвращаемое значение:
//   Булево - Истина, если переход допустим
//
Функция ПереходДопустим(ТекущееСостояние, НовоеСостояние) Экспорт

	ДопустимыеЦели = ТаблицаПереходов().Получить(ТекущееСостояние);

	Если ДопустимыеЦели = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ДопустимыеЦели.Найти(НовоеСостояние) <> Неопределено;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает таблицу допустимых переходов: состояние -> массив целевых состояний.
// Позвоночник только вперёд (INV-04). «Закрыта» - терминал, исходящих переходов нет.
// «Черновик» вне позвоночника: единственный переход - Подана (отмена черновика = удаление).
//
Функция ТаблицаПереходов()

	Состояния = Перечисления.Кабиторий_СостоянияОказанияУслуги;
	Переходы = Новый Соответствие;

	Переходы.Вставить(Состояния.Черновик,             Цели(Состояния.Подана));
	Переходы.Вставить(Состояния.Подана,               Цели(Состояния.НаМодерации, Состояния.Акцептована, Состояния.Закрыта));
	Переходы.Вставить(Состояния.НаМодерации,          Цели(Состояния.Акцептована, Состояния.Закрыта));
	Переходы.Вставить(Состояния.Акцептована,          Цели(Состояния.Исполнение, Состояния.Закрыта));
	Переходы.Вставить(Состояния.Исполнение,           Цели(Состояния.РезультатСформирован, Состояния.Закрыта));
	Переходы.Вставить(Состояния.РезультатСформирован, Цели(Состояния.Подписан, Состояния.Выдан, Состояния.Закрыта));
	Переходы.Вставить(Состояния.Подписан,             Цели(Состояния.Выдан, Состояния.Закрыта));
	Переходы.Вставить(Состояния.Выдан,                Цели(Состояния.Закрыта));

	Возврат Переходы;

КонецФункции

// Собирает массив целевых состояний (до четырёх).
//
Функция Цели(Знач Цель1, Знач Цель2 = Неопределено, Знач Цель3 = Неопределено, Знач Цель4 = Неопределено)

	Результат = Новый Массив;
	Результат.Добавить(Цель1);

	Если Цель2 <> Неопределено Тогда
		Результат.Добавить(Цель2);
	КонецЕсли;

	Если Цель3 <> Неопределено Тогда
		Результат.Добавить(Цель3);
	КонецЕсли;

	Если Цель4 <> Неопределено Тогда
		Результат.Добавить(Цель4);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Проверяет и проставляет исход при закрытии (§6.3): «Закрыта» одна, различает исход.
//
Процедура УстановитьИсходЗакрытия(Объект, Контекст)

	Если Контекст = Неопределено
		Или НЕ Контекст.Свойство("Исход")
		Или НЕ ЗначениеЗаполнено(Контекст.Исход) Тогда
		ВызватьИсключение "Переход в «Закрыта» требует заполненный Исход в контексте перехода";
	КонецЕсли;

	Объект.Исход = Контекст.Исход;

КонецПроцедуры

#КонецОбласти
